app/Controllers/Home.php

    public function users(){
        $userModel = new User();
        $users = $userModel->paginate(10);
---
SELECT *
FROM `users`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `users`