app/Controllers/UserController.php

    public function index()
    {
        $userModel = new User();
        $users = $userModel->paginate(10);
---
SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`