app/Models/User.php

SELECT *
FROM `users`
ORDER BY `id` ASC
 LIMIT 10
---
    public function getData($start, $limit)
    {
        // Get data with offset and limit for pagination
        return $this->orderBy('id', 'ASC')
                    ->findAll($limit, $start); // Fetch $limit number of rows starting from $start